/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct SPISettings {
        pub clck: u32,
        pub border: u8,
        pub dmode: u8,
    }
    #[test]
    fn bindgen_test_layout_SPISettings() {
        assert_eq!(
            ::std::mem::size_of::<SPISettings>(),
            8usize,
            concat!("Size of: ", stringify!(SPISettings))
        );
        assert_eq!(
            ::std::mem::align_of::<SPISettings>(),
            4usize,
            concat!("Alignment of ", stringify!(SPISettings))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPISettings>())).clck as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SPISettings),
                "::",
                stringify!(clck)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPISettings>())).border as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SPISettings),
                "::",
                stringify!(border)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPISettings>())).dmode as *const _ as usize },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(SPISettings),
                "::",
                stringify!(dmode)
            )
        );
    }
    #[repr(C)]
    pub struct SPI__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct SPI {
        pub vtable_: *const SPI__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_SPI() {
        assert_eq!(
            ::std::mem::size_of::<SPI>(),
            8usize,
            concat!("Size of: ", stringify!(SPI))
        );
        assert_eq!(
            ::std::mem::align_of::<SPI>(),
            8usize,
            concat!("Alignment of ", stringify!(SPI))
        );
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI5beginEi"]
        pub fn SPI_begin(busNo: ::std::os::raw::c_int);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI3endEv"]
        pub fn SPI_end();
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI11setBitOrderEh"]
        pub fn SPI_setBitOrder(bit_order: u8);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI11setDataModeEh"]
        pub fn SPI_setDataMode(data_mode: u8);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI15setClockDividerEt"]
        pub fn SPI_setClockDivider(spi_speed: u16);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI10chipSelectEi"]
        pub fn SPI_chipSelect(csn_pin: ::std::os::raw::c_int);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI16beginTransactionE11SPISettings"]
        pub fn SPI_beginTransaction(settings: root::SPISettings);
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPI14endTransactionEv"]
        pub fn SPI_endTransaction();
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPIC1Ev"]
        pub fn SPI_SPI(this: *mut root::SPI);
    }
    impl SPI {
        #[inline]
        pub unsafe fn begin(busNo: ::std::os::raw::c_int) {
            SPI_begin(busNo)
        }
        #[inline]
        pub unsafe fn end() {
            SPI_end()
        }
        #[inline]
        pub unsafe fn setBitOrder(bit_order: u8) {
            SPI_setBitOrder(bit_order)
        }
        #[inline]
        pub unsafe fn setDataMode(data_mode: u8) {
            SPI_setDataMode(data_mode)
        }
        #[inline]
        pub unsafe fn setClockDivider(spi_speed: u16) {
            SPI_setClockDivider(spi_speed)
        }
        #[inline]
        pub unsafe fn chipSelect(csn_pin: ::std::os::raw::c_int) {
            SPI_chipSelect(csn_pin)
        }
        #[inline]
        pub unsafe fn beginTransaction(settings: root::SPISettings) {
            SPI_beginTransaction(settings)
        }
        #[inline]
        pub unsafe fn endTransaction() {
            SPI_endTransaction()
        }
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            SPI_SPI(&mut __bindgen_tmp);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}__ZN3SPID1Ev"]
        pub fn SPI_SPI_destructor(this: *mut root::SPI);
    }
    pub const rf24_datarate_e_RF24_1MBPS: root::rf24_datarate_e = 0;
    pub const rf24_datarate_e_RF24_2MBPS: root::rf24_datarate_e = 1;
    pub const rf24_datarate_e_RF24_250KBPS: root::rf24_datarate_e = 2;
    #[doc = " Data rate.  How fast data moves through the air."]
    #[doc = ""]
    #[doc = " For use with setDataRate()"]
    pub type rf24_datarate_e = u32;
    pub const rf24_crclength_e_RF24_CRC_DISABLED: root::rf24_crclength_e = 0;
    pub const rf24_crclength_e_RF24_CRC_8: root::rf24_crclength_e = 1;
    pub const rf24_crclength_e_RF24_CRC_16: root::rf24_crclength_e = 2;
    #[doc = " CRC Length.  How big (if any) of a CRC is included."]
    #[doc = ""]
    #[doc = " For use with setCRCLength()"]
    pub type rf24_crclength_e = u32;
    #[repr(C)]
    pub struct RF24__bindgen_vtable(::std::os::raw::c_void);
    #[doc = " Driver for nRF24L01(+) 2.4GHz Wireless Transceiver"]
    #[repr(C)]
    pub struct RF24 {
        pub vtable_: *const RF24__bindgen_vtable,
        pub spi: root::SPI,
        #[doc = "< \"Chip Enable\" pin, activates the RX or TX role"]
        pub ce_pin: u16,
        #[doc = "< SPI Chip select"]
        pub csn_pin: u16,
        #[doc = "< SPI Bus Speed"]
        pub spi_speed: u16,
        pub spi_rxbuff: [u8; 33usize],
        pub spi_txbuff: [u8; 33usize],
        pub p_variant: bool,
        #[doc = "< Fixed size of payloads"]
        pub payload_size: u8,
        #[doc = "< Whether dynamic payloads are enabled."]
        pub dynamic_payloads_enabled: bool,
        #[doc = "< Last address set on pipe 0 for reading."]
        pub pipe0_reading_address: [u8; 5usize],
        #[doc = "< The address width to use - 3,4 or 5 bytes."]
        pub addr_width: u8,
        pub failureDetected: bool,
        #[doc = " The driver will delay for this duration when stopListening() is called"]
        #[doc = ""]
        #[doc = " When responding to payloads, faster devices like ARM(RPi) are much faster than Arduino:"]
        #[doc = " 1. Arduino sends data to RPi, switches to RX mode"]
        #[doc = " 2. The RPi receives the data, switches to TX mode and sends before the Arduino radio is in RX mode"]
        #[doc = " 3. If AutoACK is disabled, this can be set as low as 0. If AA/ESB enabled, set to 100uS minimum on RPi"]
        #[doc = ""]
        #[doc = " @warning If set to 0, ensure 130uS delay after stopListening() and before any sends"]
        pub txDelay: u32,
        #[doc = " On all devices but Linux and ATTiny, a small delay is added to the CSN toggling function"]
        #[doc = ""]
        #[doc = " This is intended to minimise the speed of SPI polling due to radio commands"]
        #[doc = ""]
        #[doc = " If using interrupts or timed requests, this can be set to 0 Default:5"]
        pub csDelay: u32,
    }
    #[test]
    fn bindgen_test_layout_RF24() {
        assert_eq!(
            ::std::mem::size_of::<RF24>(),
            112usize,
            concat!("Size of: ", stringify!(RF24))
        );
        assert_eq!(
            ::std::mem::align_of::<RF24>(),
            8usize,
            concat!("Alignment of ", stringify!(RF24))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).spi as *const _ as usize },
            8usize,
            concat!("Offset of field: ", stringify!(RF24), "::", stringify!(spi))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).ce_pin as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(ce_pin)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).csn_pin as *const _ as usize },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(csn_pin)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).spi_speed as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(spi_speed)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).spi_rxbuff as *const _ as usize },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(spi_rxbuff)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).spi_txbuff as *const _ as usize },
            55usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(spi_txbuff)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).p_variant as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(p_variant)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).payload_size as *const _ as usize },
            89usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(payload_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<RF24>())).dynamic_payloads_enabled as *const _ as usize
            },
            90usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(dynamic_payloads_enabled)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).pipe0_reading_address as *const _ as usize },
            91usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(pipe0_reading_address)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).addr_width as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(addr_width)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).failureDetected as *const _ as usize },
            97usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(failureDetected)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).txDelay as *const _ as usize },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(txDelay)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RF24>())).csDelay as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(RF24),
                "::",
                stringify!(csDelay)
            )
        );
    }
    extern "C" {
        #[doc = " Begin operation of the chip"]
        #[doc = ""]
        #[doc = " Call this in setup(), before calling any other methods."]
        #[doc = " @code radio.begin() @endcode"]
        #[link_name = "\u{1}__ZN4RF245beginEv"]
        pub fn RF24_begin(this: *mut root::RF24) -> bool;
    }
    extern "C" {
        #[doc = " Checks if the chip is connected to the SPI bus"]
        #[link_name = "\u{1}__ZN4RF2415isChipConnectedEv"]
        pub fn RF24_isChipConnected(this: *mut root::RF24) -> bool;
    }
    extern "C" {
        #[doc = " Start listening on the pipes opened for reading."]
        #[doc = ""]
        #[doc = " 1. Be sure to call openReadingPipe() first."]
        #[doc = " 2. Do not call write() while in this mode, without first calling stopListening()."]
